package view.chenyu.com.freedom;

import android.os.Bundle;
import android.support.annotation.Nullable;
import android.support.v7.app.AppCompatActivity;
import android.view.View;

import com.tencent.bugly.crashreport.BuglyLog;
import com.tencent.bugly.crashreport.CrashReport;


/**
 * @desc TODO
 * @author 王兴岭
 * @email wxlhdm@qq.com
 * @create 2017/6/12 17:31
**/
public class CrashReportActivity extends AppCompatActivity {

    public static final String TAG = CrashReportActivity.class.getSimpleName();

    @Override
    protected void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_crash);
    }

    public void createCrash(View view) {
        CrashReport.testJavaCrash();
    }

    public void createCustomCrash(View view) {
        BuglyLog.e(TAG,"自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志");
        BuglyLog.e(TAG,"自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志");
        BuglyLog.e(TAG,"自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志自定义错误日志");
        CrashReport.postCatchedException(new RuntimeException("自定义异常"));
    }

    public void testANR(View view) {
        CrashReport.testANRCrash();
    }
}
